[
    {
        "id": "1",
        "name": "Panametrics (Baker Hughes)",
        "description": "BlackWell LLC proudly announces its appointment as the official distributor of the Panametrics (Baker Hughes) brand in six countries. This strategic partnership enables us to deliver world-class products and services designed to improve operational efficiency and drive technological innovation.\n\nPanametrics, a Baker Hughes brand, is a global leader in precise and reliable measurement solutions, serving critical sectors including oil and gas, refining, petrochemicals, and power generation. Core Product Offerings:• Ultrasonic Flow Meters  Real-time, accurate measurement of liquid and gas flows.\n• Gas and Moisture Analyzers – Advanced monitoring of gas composition and moisture levels in industrial processes.\n• Portable Flow Meters – Flexible, on-the-go measurement tools for field applications.\n\nPanametrics technologies are known for their durability, accuracy, and adaptability in even the most demanding envir",
        "image": "https://vertassets.blob.core.windows.net/image/0761e1d9/0761e1d9-da53-416c-9c73-0a32e9f4b9bc/panametrics.jpg",
        "url": "https://www.bakerhughes.com/panametrics/process-analyzers/"
    },
    {
        "id": "2",
        "name": "Gottfert",
        "description": "We are pleased to announce that BlackWell LLC has become the official distributor of Gottfert products in Azerbaijan. This exciting partnership allows BlackWell to further expand its portfolio by offering top-tier products and services across the region.\n\nAbout Gottfert\nGottfert is a globally recognized leader in rheology testing systems and polymer characterization technologies. Their state-of-the-art equipment is designed for high-precision testing, ensuring top quality standards in industries such as plastics, rubber, and composites.\n\nBlackWell's Role\nAs the exclusive distributor of Gottfert products in Azerbaijan, BlackWell will provide:\n• Sales of Gottfert Products: Full access to the complete Gottfert catalog, including advanced testing systems and accessories.\n• Service and Support: Our experienced team will offer installation, technical support, maintenance, and repair services for all Gottfert products — ensuring smooth and efficient operations for your business.",
        "image": "https://www.dastecsrl.com.ar/uploads/Representadas/goettfert-logo_1.jpg",
        "url": "https://www.goettfert.com/products/overview-of-all-products"
    },
    {
        "id": "3",
        "name": "CDB Engineering",
        "description": "We are excited to announce that BlackWell LLC is now the official distributor of CDB Engineering in Azerbaijan. Through this strategic partnership, BlackWell continues to broaden its offerings by bringing top-quality engineering solutions to the local market.\n\nAbout CDB Engineering\nCDB Engineering is a globally recognized provider of specialized engineering solutions for the oil, gas, and energy sectors. With decades of experience, they design and manufacture innovative products and systems built to perform in the most demanding industrial environments.\n\nBlackWell’s Role\nAs the exclusive distributor of CDB Engineering products in Azerbaijan, BlackWell provides:\n• Sales: Direct access to CDB Engineering’s complete catalog of equipment and systems.\n• Service and Support: Professional installation, maintenance, technical support, and repairs — all handled by our expert team.\n\nWith BlackWell, you benefit from local expertise, global standards, and end-to-end support that drives results.",
        "image": "https://expovalve.it/filesystem/f3/7595ab7f4d864a66236919f35ca05450.jpg",
        "url": "https://www.cdbengineering.com/products/"
    },
    {
        "id": "4",
        "name": "Cianalytics",
        "description": "We are pleased to announce that BlackWell LLC is now the official partner of Cianalytics in Azerbaijan. Through this partnership, we will manage sales and technical services for all Cianalytics products in the region, providing advanced technology solutions for critical industries.\n\nAbout Cianalytics\nCianalytics specializes in high-precision gas analyzers, process monitoring systems, laboratory instruments, and industrial sensors. Their innovative products serve key sectors including oil & gas, chemical manufacturing, power generation, and environmental monitoring.\n\nBlackWell’s Role\nAs Cianalytics’ exclusive partner in Azerbaijan, BlackWell offers:\n• Sales of advanced analytical and monitoring technologies\n• Installation, technical support, maintenance, and repair services\n\nThis collaboration allows BlackWell to deliver world-class solutions supported by local expertise — ensuring performance, reliability, and safety in every application.",
        "image": "https://cianalytics.com/themes/cia/assets/images/logos/logo-full-bk.png",
        "url": "https://cianalytics.com/"
    },
    {
        "id": "6",
        "name": "General Instruments in Azerbaijan",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of General Instruments in Azerbaijan. This exciting partnership enhances our ability to deliver high-quality instrumentation solutions across various industries in the region.\n\nAbout General Instruments\nGeneral Instruments is a renowned manufacturer of precision instruments for pressure, temperature, flow, and level measurement. Their products are trusted across sectors such as oil and gas, petrochemicals, power, and process industries—offering reliable and accurate performance in critical applications.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of General Instruments in Azerbaijan, BlackWell provides:\n• Sales: Full access to General Instruments’ comprehensive portfolio, including pressure gauges, temperature sensors, level switches, and flow meters.\n• Service and Support: Expert installation, technical support, maintenance, and repair services to ensure maximum performance and long-term reliability of all General Instruments products.",
        "image": "https://media.licdn.com/dms/image/v2/C560BAQH-qR05ZPPv-w/company-logo_200_200/company-logo_200_200/0/1647851859566/general_instruments_consortium_india_pvt_ltd_logo?e=1749686400&v=beta&t=aTC3DY8s0hzBoyKJpZYQuImZGPfk8xXVo1l1d-GgPWQ",
        "url": "https://www.generalinstruments.net/"
    },
    {
        "id": "7",
        "name": "Wika",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of WIKA in Azerbaijan. This strategic partnership strengthens our ability to provide advanced measurement technology and support services across various industries in the region.\n\nAbout WIKA\nWIKA is a global leader in precision instruments for pressure, temperature, level, and flow measurement. Their solutions are trusted in oil and gas, chemicals, power generation, water treatment, and industrial automation for their reliability and performance.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of WIKA in Azerbaijan, BlackWell offers:\n• Sales: Access to WIKA’s complete portfolio, including pressure gauges, diaphragm seals, differential pressure devices, and electronic measuring instruments.\n• Service and Support: Expert technical consultation, calibration, installation, and maintenance services to ensure reliable operation and long-term efficiency of WIKA systems.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRHulgwsTESsFnGhGOHMt1gQiof1M_LFLApWw&s",
        "url": "https://www.wika.com/en-en/products.WIKA"
    },
    {
        "id": "8",
        "name": "Aerzen",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of Aerzen in Azerbaijan. This partnership enables us to deliver advanced air and gas handling solutions tailored to the industrial demands of the region.\n\nAbout Aerzen\nAerzen is a globally recognized manufacturer specializing in high-performance blowers, compressors, and vacuum technology. Their products are known for energy efficiency, long service life, and innovative engineering across sectors such as wastewater, chemical, cement, and food industries.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of Aerzen in Azerbaijan, BlackWell provides:\n• Sales: Complete access to Aerzen’s portfolio including rotary lobe blowers, screw compressors, and process gas systems.\n• Service and Support: Expert installation, routine maintenance, diagnostics, and repair services to ensure peak system performance and reliability.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHJ5uen0NETjSQYGRlZWPpeLS6tRcqoNF_-A&s",
        "url": "https://www2.aerzen.com/products.html"
    },
    {
        "id": "9",
        "name": "Gentec",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of Gentec in Azerbaijan. This collaboration enhances our offering of precision gas control equipment across multiple industries in the region.\n\nAbout Gentec\nGentec (Genstar Technologies) is a globally trusted manufacturer of high-quality gas control systems and components. Their extensive product line includes pressure regulators, flow meters, gas delivery systems, and welding accessories—designed for safety and performance in demanding environments.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of Gentec in Azerbaijan, BlackWell provides:\n• Sales: Access to Gentec’s full portfolio including gas regulators, manifolds, and flow control systems, supported by expert guidance tailored to each customer’s needs.\n• Service and Support: Professional installation, ongoing maintenance, training, and responsive technical support to ensure the reliable and safe use of Gentec systems in healthcare, energy, welding, and research sectors.",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWdYQAeC-ffIaYxnyJW0JXa0A3uVPThbZ3LA&s",
        "url": "https://www.bakerhughes.com/panametrics/process-analyzers/"
    },
    {
        "id": "10",
        "name": "Nirmal",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of Nirmal in Azerbaijan. Through this partnership, we bring a wide range of high-performance pressure and flow control solutions to the local market.\n\nAbout Nirmal\nNirmal is a trusted global manufacturer of advanced pressure regulators, safety relief valves, and flow control systems. Known for innovation and reliability, Nirmal products are used in industries such as oil & gas, petrochemicals, power, and water treatment.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of Nirmal in Azerbaijan, BlackWell provides:\n• Sales: Full access to Nirmal’s product range, including pressure-reducing valves, pilot-operated regulators, globe control valves, and custom-engineered process systems.\n• Service and Support: Expert installation, technical guidance, system design, and maintenance services to ensure the efficient and safe operation of Nirmal products across various industrial applications.",
        "image": "https://media.licdn.com/dms/image/v2/C4D0BAQE9w4OgQ_CBdA/company-logo_200_200/company-logo_200_200/0/1674194987101/nirmalindustrialcontrol_logo?e=2147483647&v=beta&t=dVQtGZuaAN3pzDWKTBoHdgnSvvnpsOIWgycuQ0_n2vQ",
        "url": "https://nirmal.co.in/products/"
    },
    {
        "id": "11",
        "name": "Astec",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of Astec in Azerbaijan. This partnership strengthens our ability to deliver precision flow, pressure, and temperature measurement solutions across the region.\n\nAbout Astec\nAstec is a leading manufacturer of high-performance instrumentation and control equipment. Their product portfolio includes flow meters, pressure transmitters, temperature sensors, and flow control valves designed for use in industries such as oil & gas, water treatment, chemical processing, and power generation.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of Astec in Azerbaijan, BlackWell offers:\n• Sales: Complete access to Astec’s range of turbine and Coriolis flow meters, RTDs, thermocouples, pressure gauges, and industrial valves for critical process applications.\n• Service and Support: Professional installation, system integration, calibration, and technical support services to ensure efficient and reliable performance across all Astec systems in demanding industrial environments.",
        "image": "https://media.licdn.com/dms/image/v2/C4D0BAQHIZ4GyC3RwAw/company-logo_200_200/company-logo_200_200/0/1630577571509/astecindustries_logo?e=2147483647&v=beta&t=BfEPstloWwnfMkHnRo5KCoAdNO7CETr63kFzIIYZBgc",
        "url": "https://www.astecindustries.com/forestry-environmental-recycling"
    },
    {
        "id": "12",
        "name": "NuovaFima",
        "description": "We are pleased to announce that BlackWell LLC is now the official distributor of NuovaFima in Azerbaijan. This partnership expands our offering of industrial measurement instruments to better serve a wide range of sectors in the region.\n\nAbout NuovaFima\nNuovaFima is a trusted manufacturer of pressure and temperature measurement devices for industrial applications. Their product line includes pressure gauges, differential pressure instruments, temperature gauges, diaphragm seals, and accessories—designed for accuracy, durability, and reliability.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of NuovaFima in Azerbaijan, BlackWell provides:\n• Sales: Access to NuovaFima’s full portfolio, including Bourdon tube and diaphragm gauges, bimetal thermometers, and customized measurement solutions.\n• Service and Support: Professional installation, calibration, and ongoing technical assistance to ensure reliable operation across industries such as oil & gas, chemical processing, energy, and manufacturing.",
        "url": "https://www.nuovafima.com/en/prodotti/",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSZROnbCneYHfMiOOG7DNHfbD5sCm7KOPoGxQ&s"
    },
    {
        "id": "13",
        "name": "SUFA",
        "url": "https://www.chinasufa.com.cn/sufa_en/1432690/1432648/petrochemical_valve/vforahu/index.html",
        "description": "We are pleased to announce that BlackWell MMC is now the official distributor of SUFA in Azerbaijan. This partnership allows us to deliver advanced valve solutions and technical expertise across multiple industries in the region.\n\nAbout SUFA\nSUFA is an internationally recognized manufacturer of industrial valves, offering a wide range of products including gate, globe, ball, and check valves. Designed for high-pressure and heavy-duty applications, SUFA’s valves are used extensively in oil & gas, petrochemicals, power generation, and offshore industries.\n\nBlackWell’s Role as Official Distributor\nAs the exclusive distributor of SUFA in Azerbaijan, BlackWell provides:\n• Sales: Full access to SUFA’s comprehensive valve portfolio, including specialized and thermal valves tailored to both onshore and offshore projects.\n• Service and Support: Technical inspections, repair services, training, and ongoing maintenance support to ensure the safe and efficient operation of all SUFA valve systems.",
        "image": "https://media.licdn.com/dms/image/v2/C4E0BAQG90F0Mo5kiRg/company-logo_200_200/company-logo_200_200/0/1630567320574/sufa_technology_industry_co_ltd_cnnc__logo?e=2147483647&v=beta&t=dzksv2UGmI6PKywxO0AOmukLZ8JFSqsyDjEj9cxrrao"
    }
]